spec/load.yml
config:
  target: "http://127.0.0.1:3000/reviews"
  phases:
    - duration: 10
      arrivalRate: 1

scenarios:
  - name: "Get reviews or meta data for products"
    flow:
      - get:
          url: "/?product_id={{ $randomNumber(1, 1000010) }}"
      - get:
          url: "/meta?product_id={{ $randomNumber(1, 1000010) }}"